_org_posts/_posts/2021-09-04-abc217-d.org
#+HTML: ---
#+HTML: layout: post
#+HTML: title: D - Cutting Woods
#+HTML: tags: AtCoder
#+HTML: ---
#+OPTIONS: ^:nil

** TODO D - Cutting Woods
- 큰 통나무가 있고, query를 통해
- 통나무를 자른다.
- 자른 통나무 조각의 길이를 잰다.

** 접근하기
- STL set을 이용해서 풀이
- set에 int를 insert하면, 정렬된 상태로 저장됨.
- upper_bound를 이용해서 x보다 큰 가장 가까운 값의 위치를 얻을 수 있음

** 코드
#+BEGIN_SRC cpp
#include <cstdio>
#include <algorithm>
#include <set>
using namespace std;

int L, Q;

int main(int argc, char* argv[])
{
    set<int> st;
    scanf("%d %d", &L, &Q);
    st.insert(0);            // 0을 추가
    st.insert(L);            // L을 추가 -> L - 0은 전체의 길이가 된다.

    int c, x;
    for(int i=0;i<Q;i++) {
        scanf("%d %d", &c, &x);

        if (c == 1) {
            st.insert(x);    // 정렬된 순서로 추가
        } else if (c == 2) {
            auto i = st.upper_bound(x);  // x보다 큰 첫번짹 값의 위치를 구함
            int up = *i;
            i--;
            int down = *i;
            printf("%d\n", up - down);
        }
    }
    return 0;
}
#+END_SRC

** 문제 링크
- https://atcoder.jp/contests/abc217/tasks/abc217_d
